G = (2, 3, 10, 4, 1, 5, 6, 7, 8, 11, 15, 14, 12, 13, 9, 0)
A = {
    'А': int('000001', 2),
    'Б': int('001001', 2),
    'В': int('001010', 2),
    'Г': int('001011', 2),
    'Д': int('000010', 2),
    'Е': int('001100', 2),
    'Ж': int('001101', 2),
    'З': int('001110', 2),
    'И': int('000011', 2),
    'Й': int('011111', 2),
    'К': int('001111', 2),
    'Л': int('010000', 2),
    'М': int('010001', 2),
    'Н': int('010010', 2),
    'О': int('000100', 2),
    'П': int('010011', 2),
    'Р': int('010100', 2),
    'С': int('010101', 2),
    'Т': int('010110', 2),
    'У': int('000101', 2),
    'Ф': int('010111', 2),
    'Х': int('011000', 2),
    'Ц': int('000000', 2),
    'Ч': int('011010', 2),
    'Ш': int('011011', 2),
    'Щ': int('011100', 2),
    'Ы': int('011101', 2),
    'Ь': int('011110', 2),
    'Ъ': int('011001', 2),
    'Э': int('000110', 2),
    'Ю': int('000111', 2),
    'Я': int('001000', 2),
}
# inverse A dictionary (swap key and value)
A_INV = {v: k for k, v in A.items()}

def gamma(text, key=G):
    text = clear_text(text)
    res = ''
    for i in range(len(text)):
        if text[i] in A:
            # делаем побитовое XOR и отсекаем все биты, кроме первых 5-ти
            res += A_INV[(key[i % len(key)] ^ A[text[i]]) & 0b11111]
        else:
            res += text[i]
    return res


def clear_text(text):
    return text \
        .upper()\
        .replace('Ё', 'Е')